Autodesk.Revit.DB.INavisworksExporter.ValidateExportOptions(Autodesk.Revit.DB.Document,System.String,System.String,Autodesk.Revit.DB.NavisworksExportOptions,System.String@)
Determines if the inputs are valid, and returns an error message if not.
document:
The document to export.
folder:
The folder path.
name:
The file name.
options:
The export options.
exceptionMessage:
The message to show in the exception thrown.  This is not an end-user visible message, it is a
developer message, and does not have to be localized.  Ignored if the function returns true.
Returns:
True if the options are valid, false otherwise.
Since:
2014

Autodesk.Revit.DB.INavisworksExporter.Export(Autodesk.Revit.DB.Document,System.String,System.String,Autodesk.Revit.DB.NavisworksExportOptions)
The method that Revit will invoke to perform an export to Navisworks.
document:
The document to export.
folder:
The folder path.
name:
The file name.
options:
The export options.
Since:
2014

Autodesk.Revit.DB.INavisworksExporter
The interface used to implement a Navisworks exporter.
Remarks:
Implement this interface and register an instance of the derived class with the Navisworks external service.
Since:
2014